app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "jwgalvin@gmail.com"], ["created_at", "2022-04-16 21:02:48.413572"], ["updated_at", "2022-04-16 21:02:48.413572"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jwgalvin@gmail.com"], ["LIMIT", 1]]
---
  def create
    auth_hash = request.env['omniauth.auth']
    email = auth_hash['info']['email']
    user = User.find_or_create_by(email: email)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jwgalvin@gmail.com"], ["LIMIT", 1]]
---
  def index
    @user = User.find_by(email: session[:access_token])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jwgalvin@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "dob" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Vernon Howell"], ["dob", "2022-03-28"], ["updated_at", "2022-04-17 20:53:28.745539"], ["id", 1]]
---
  def edit
    user = User.find_by(email: session[:access_token])
    if params[:name] && params[:dob]
      user.update(user_params)